***REMOVED***"format": "layers-model", "generatedBy": "keras v2.5.0", "convertedBy": "TensorFlow.js Converter v3.6.0", "modelTopology": ***REMOVED***"keras_version": "2.5.0", "backend": "tensorflow", "model_config": ***REMOVED***"class_name": "Sequential", "config": ***REMOVED***"name": "sequential", "layers": [***REMOVED***"class_name": "InputLayer", "config": ***REMOVED***"batch_input_shape": [null, 11], "dtype": "float32", "sparse": false, "ragged": false, "name": "InputLayer"***REMOVED******REMOVED***, ***REMOVED***"class_name": "Dense", "config": ***REMOVED***"name": "hiddenLayer1", "trainable": true, "batch_input_shape": [null, null, 11], "dtype": "float32", "units": 8, "activation": "tanh", "use_bias": true, "kernel_initializer": ***REMOVED***"class_name": "GlorotUniform", "config": ***REMOVED***"seed": null***REMOVED******REMOVED***, "bias_initializer": ***REMOVED***"class_name": "Zeros", "config": ***REMOVED******REMOVED******REMOVED***, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null***REMOVED******REMOVED***, ***REMOVED***"class_name": "Dropout", "config": ***REMOVED***"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null***REMOVED******REMOVED***, ***REMOVED***"class_name": "Dense", "config": ***REMOVED***"name": "hiddenLayer2", "trainable": true, "dtype": "float32", "units": 8, "activation": "tanh", "use_bias": true, "kernel_initializer": ***REMOVED***"class_name": "GlorotUniform", "config": ***REMOVED***"seed": null***REMOVED******REMOVED***, "bias_initializer": ***REMOVED***"class_name": "Zeros", "config": ***REMOVED******REMOVED******REMOVED***, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null***REMOVED******REMOVED***, ***REMOVED***"class_name": "Dropout", "config": ***REMOVED***"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null***REMOVED******REMOVED***, ***REMOVED***"class_name": "Dense", "config": ***REMOVED***"name": "outputLayer", "trainable": true, "dtype": "float32", "units": 6, "activation": "linear", "use_bias": true, "kernel_initializer": ***REMOVED***"class_name": "GlorotUniform", "config": ***REMOVED***"seed": null***REMOVED******REMOVED***, "bias_initializer": ***REMOVED***"class_name": "Zeros", "config": ***REMOVED******REMOVED******REMOVED***, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null***REMOVED******REMOVED***]***REMOVED******REMOVED***, "training_config": ***REMOVED***"loss": "mean_squared_error", "metrics": [[***REMOVED***"class_name": "MeanMetricWrapper", "config": ***REMOVED***"name": "accuracy", "dtype": "float32", "fn": "categorical_accuracy"***REMOVED******REMOVED***]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": ***REMOVED***"class_name": "Adam", "config": ***REMOVED***"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false***REMOVED******REMOVED******REMOVED******REMOVED***, "weightsManifest": [***REMOVED***"paths": ["group1-shard1of1.bin"], "weights": [***REMOVED***"name": "hiddenLayer1/kernel", "shape": [11, 8], "dtype": "float32"***REMOVED***, ***REMOVED***"name": "hiddenLayer1/bias", "shape": [8], "dtype": "float32"***REMOVED***, ***REMOVED***"name": "hiddenLayer2/kernel", "shape": [8, 8], "dtype": "float32"***REMOVED***, ***REMOVED***"name": "hiddenLayer2/bias", "shape": [8], "dtype": "float32"***REMOVED***, ***REMOVED***"name": "outputLayer/kernel", "shape": [8, 6], "dtype": "float32"***REMOVED***, ***REMOVED***"name": "outputLayer/bias", "shape": [6], "dtype": "float32"***REMOVED***]***REMOVED***]***REMOVED***